app/controllers/github_projects_controller.rb

  def index
    @github_projects = GithubProject.all
---
SELECT * FROM "github_projects"

  def show
    @github_project = GithubProject.find(params[:id])
---
SELECT * FROM "github_projects" WHERE ("github_projects"."id" = 1)

  def edit
    @github_project = GithubProject.find(params[:id])
---
SELECT * FROM "github_projects" WHERE ("github_projects"."id" = 1)

  def create
    @github_project = GithubProject.new(params[:github_project])

    respond_to do |format|
      if @github_project.save
---
INSERT INTO "github_projects" ("title", "github_name", "created_at", "updated_at") VALUES('title1', 'name1', '2010-03-05 20:00:12', '2010-03-05 20:00:12')

  def update
    @github_project = GithubProject.find(params[:id])

    respond_to do |format|
      if @github_project.update_attributes(params[:github_project])
---
SELECT * FROM "github_projects" WHERE ("github_projects"."id" = 2)
UPDATE "github_projects" SET "title" = 'title3', "github_name" = 'name3', "updated_at" = '2010-03-05 20:00:32' WHERE "id" = 2