app/controllers/log_book_entries_controller.rb

SELECT * FROM "github_projects" WHERE ("github_projects"."id" IN (4,2,3))
SELECT * FROM "log_book_entries" WHERE ("log_book_entries"."id" IN (3,4,5,6,7,8))
SELECT * FROM "users" WHERE ("users"."id" IN (8,5,6,7))
SELECT "log_book_entries".* FROM "log_book_entries" INNER JOIN "users" ON "users".id = "log_book_entries".user_id INNER JOIN "github_projects" ON "github_projects".id = "log_book_entries".github_project_id ORDER BY log_book_entries.updated_at
SELECT * FROM "github_projects"
SELECT * FROM "users" ORDER BY name
---
  def index
    initialize #Initializes the parameters

    #The Include parameter in the following find method reduces the number of sql queries that run on the databse. Joins, runs an inner join.
    #@log_book_entries = LogBookEntry.find(:all, :joins => [:user, :github_project], :include =>[:user, :github_project ], :order => @extended_order)
    @log_book_entries = LogBookEntry.find(:all, :include =>[:user, :github_project ], :order => @extended_order)
    @size = @log_book_entries.size #Used in views to show how many results were found. we cannot paginate before this else we get a wrong number.
    @log_book_entries = @log_book_entries.paginate :page => params[:page]

SELECT * FROM "log_book_entries" WHERE ("log_book_entries"."id" = 1)
---
  def show
    @log_book_entry = LogBookEntry.find(params[:id])

SELECT * FROM "log_book_entries" WHERE ("log_book_entries"."id" = 4)
---
  def edit
    @log_book_entry = LogBookEntry.find(params[:id])

INSERT INTO "log_book_entries" ("title", "description", "solution", "user_id", "sha_of_problem", "sha_of_solution", "github_project_id", "created_at", "updated_at") VALUES('title1', 'desc1', 'sol`', 0, '', '', 0, '2010-03-05 20:48:00', '2010-03-05 20:48:00')
---
  def create
    @log_book_entry = LogBookEntry.new(params[:log_book_entry])

    if @log_book_entry.save # Gags: Save validates the entries.
      flash[:notice] = 'LogBookEntry was successfully created.'

SELECT * FROM "log_book_entries" WHERE ("log_book_entries"."id" = 4)
UPDATE "log_book_entries" SET "sha_of_problem" = '00d3e7f1b3285aa939724710519b92e5cd4fdc7f', "sha_of_solution" = '00d3e7f1b3285aa939724710519b92e5cd4fdc7f', "updated_at" = '2010-03-18 18:31:05' WHERE "id" = 6
---
  def update
    @log_book_entry = LogBookEntry.find(params[:id])

    if @log_book_entry.update_attributes(params[:log_book_entry])

SELECT * FROM "log_book_entries" WHERE ("log_book_entries"."id" = 1)
DELETE FROM "log_book_entries" WHERE "id" = 1
---
  def destroy
    @log_book_entry = LogBookEntry.find(params[:id])
    @log_book_entry.destroy