app/controllers/search_controller.rb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_id = 4) AND ("taggings".taggable_type = 'LogBookEntry'))
SELECT DISTINCT log_book_entries.* FROM "log_book_entries" INNER JOIN taggings log_book_entries_taggings ON log_book_entries_taggings.taggable_id = log_book_entries.id AND log_book_entries_taggings.taggable_type = 'LogBookEntry' INNER JOIN tags log_book_entries_tags ON log_book_entries_tags.id = log_book_entries_taggings.tag_id WHERE ((log_book_entries_tags.name LIKE 'Neat')) ORDER BY log_book_entries.updated_at
SELECT "log_book_entries".* FROM "log_book_entries" INNER JOIN "users" ON "users".id = "log_book_entries".user_id INNER JOIN "github_projects" ON "github_projects".id = "log_book_entries".github_project_id
---
  def label
    initialize
    @matched_entries = LogBookEntry.scoped(:order => @order , :joins => [:user, :github_project], :include =>[:user, :github_project, :tags]).find_tagged_with(params[:token]) #using scoped to run the find_tagged_by rather than having an array being returned.
    @size = @matched_entries.size
    @matched_entries = @matched_entries.paginate :page => params[:page]

SELECT * FROM "log_book_entries" LIMIT 1
---
  def query
    initialize
    @matched_entries = LogBookEntry.find_by_query(params[:token], @order )
    @size = @matched_entries.size