app/controllers/search_controller.rb

  def label
    matched_ids = LogBookEntry.find_tagged_with(params[:tag]).collect {|e| e.id}
    @matched_entries = LogBookEntry.find(matched_ids, :joins => [:user, :github_project], :order => params[:order])
---
SELECT "log_book_entries".* FROM "log_book_entries" INNER JOIN "users" ON "users".id = "log_book_entries".user_id INNER JOIN "github_projects" ON "github_projects".id = "log_book_entries".github_project_id WHERE ("log_book_entries"."id" = 4)
SELECT * FROM "github_projects" WHERE ("github_projects"."id" = 4)
SELECT * FROM "users" WHERE ("users"."id" = 8)

  def query
    if params[:query]

      @query = params[:query]
      @matched_entries = Array.new
      @log_book_entries = LogBookEntry.find(:all, :joins => [:user, :github_project])


      @log_book_entries.each do |entry|
---
SELECT * FROM "github_projects" WHERE ("github_projects"."id" = 4)
SELECT * FROM "users" WHERE ("users"."id" = 8)
SELECT "log_book_entries".* FROM "log_book_entries" INNER JOIN "users" ON "users".id = "log_book_entries".user_id INNER JOIN "github_projects" ON "github_projects".id = "log_book_entries".github_project_id