app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES('abc', 'abc@xyz.com', '2010-03-05 19:58:59', '2010-03-05 19:58:59')
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 5)
UPDATE "users" SET "email" = 'user3@xyz.com', "updated_at" = '2010-03-05 20:47:49' WHERE "id" = 5
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy